PENSION_PERIOD = 'Выберите интересующий вас период до пенсии'

PENSION_YEAR_PERIOD = (
	'Начинайте готовиться к пенсии. Уже за год до пенсии можно сдать документы на '
	'проверку (но не позднее двух месяцев до дня назначения пенсии).\n\n'
	'Обратитесь на Жукова, 4 (каб. 1.19). '
	'Запись через терминал «Сдать документы для оформления пенсии»\n\n'
)

SCHEDULE = (
	'Часы работы фронт-офиса на Жукова, 4\n\n'
	'пн-чт — 08.15-17.30, обед 12.00-13.00,\nпт — 08.15-16.00, обед 12.00-12.45'
)

NEED_DOCUMENTS = (
	'Необходимые документы (оригиналы):\n'
	'— паспорт гражданина РФ (вид на жительство);\n'
	'— СНИЛС;\n'
	'— военный билет;\n'
	'— документ об очном образовании;\n'
	'— свидетельство о браке (если была смена фамилии) или '
	'справка ЗАГС о заключении брака, если брак расторгнут;\n'
	'— свидетельства о рождении детей (женщинам – обязательно, '
	'мужчинам – у которых есть несовершеннолетние дети или '
	'учащиеся до 23 лет по очной форме обучения);\n'
	'— справки Центра занятости населения, если были периоды '
	'получения пособия по безработице;\n'
	'— справки о стаже (работа в совхозе, колхозе и т.д.), '
	'не отраженном в трудовой книжке;\n'
	'— справка, уточняющая льготные условия труда (в случае наличия на руках);\n'
	'— трудовая книжка (в случае наличия на руках, если работник выбрал '
	'электронный вариант ведения трудовой книжки)'
)