MFC_REGISTRATION = (
    "МФЦ (ул. Жукова,2).\n\n"
    "Запись на прием по телефону 77-07-07\n\n"
    "Зарегистрируйтесь на портале Госуслуг (gosuslugi.ru)\n"
    "Создайте подтвержденную учетную запись.\n\n"
    "Запомните логин и пароль — они не раз пригодятся вам в течение жизни, "
    "облегчив получение разных документов и справок.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР."
)

MOBILE_BANK_APP_REGISTRATION = (
    "На телефоне установлено мобильное приложение банка Сбербанк, "
    "ВТБ, Тинькофф или Почта Банк.\n\n"
    "Сделайте регистрацию на Госуслугах, не выходя из дома.\n\n"
    "На главной странице приложения банка среди перечня платежей "
    "и услуг выбрать категорию «Госуслуги».\n\nПройдите пошагово регистрацию.\n\n"
    "После проверки данных Вы сразу получите подтвержденную "
    "учетную запись на Госуслугах.\n\n"
    "С мобильного телефона Вы можете отслеживать состояние "
    "своего лицевого счета, записаться на прием в клиентскую "
    "службу ПФР и получать другие услуги Личного кабинета.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР."
)
