"""Module with thematic Gosuslugi site constants."""

MFC_REGISTRATION = (
    "Зарегистрироваться на Госуслугах можно при "
    "обращении в МФЦ (ул. Жукова, 2).\n\n"
    "Запись на прием по телефону 77-07-07\n\n"
    "В МФЦ Вас зарегистрируют на портале Госуслуг (gosuslugi.ru).\n\n"
    "Вы получите подтвержденную учетную запись. "
    "Запомните свой логин и пароль.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР.\n\n"
    "Доступ в Личный кабинет на Госуслугах не раз пригодится Вам "
    "в течение жизни, облегчив получение разных документов и справок."
)

MOBILE_BANK_APP_REGISTRATION = (
    "Если у Вас на телефоне установлено мобильное приложение банка "
    "(Сбербанк, ВТБ, Тинькофф или Почта Банк), Вы можете сделать регистрацию "
    "на Госуслугах, не выходя из дома.\n\n"
    "На главной странице приложения Вашего банка среди перечня платежей "
    "и услуг выберите категорию «Госуслуги».\n\n"
    "Пошагово пройдите регистрацию.\n\n"
    "После проверки данных Вы сразу получите подтвержденную "
    "учетную запись на Госуслугах.\n\n"
    "Появится полноценный доступ в Личный кабинет гражданина.\n\n"
    "С мобильного телефона Вы можете отслеживать состояние "
    "своего лицевого счета, записаться на прием в клиентскую "
    "службу ПФР и получать другие услуги Личного кабинета.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР."
)
