"""Module with thematic Gosuslugi site constants."""

MFC_REGISTRATION = (
    "Зарегистрироваться на Госуслугах можно при "
    "обращении в МФЦ (ул. Жукова, 2).\n\n"
    "Запись на прием по телефону 77-07-07\n\n"
    "В МФЦ Вас зарегистрируют на портале Госуслуг (gosuslugi.ru).\n\n"
    "Вы получите подтвержденную учетную запись. "
    "Запомните свой логин и пароль.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР.\n\n"
    "Доступ в Личный кабинет на Госуслугах не раз пригодится Вам "
    "в течение жизни, облегчив получение разных документов и справок."
)

MOBILE_BANK_APP_REGISTRATION = (
    "Если у Вас на телефоне установлено мобильное приложение банка "
    "(Сбербанк, ВТБ, Тинькофф или Почта Банк), Вы можете сделать регистрацию "
    "на Госуслугах, не выходя из дома.\n\n"
    "На главной странице приложения Вашего банка среди перечня платежей "
    "и услуг выберите категорию «Госуслуги».\n\n"
    "Пошагово пройдите регистрацию.\n\n"
    "После проверки данных Вы сразу получите подтвержденную "
    "учетную запись на Госуслугах.\n\n"
    "Появится полноценный доступ в Личный кабинет гражданина.\n\n"
    "С мобильного телефона Вы можете отслеживать состояние "
    "своего лицевого счета, записаться на прием в клиентскую "
    "службу ПФР и получать другие услуги Личного кабинета.\n\n"
    "Подтвержденная учетная запись дает доступ ко всем услугам "
    "портала Госуслуг, в том числе и доступ к сайту ПФР."
)

ILS_EXPLANATION = (
    "Индивидуальный лицевой счёт (ИЛС) — это электронный документ, "
    "в котором находится вся информация о "
    "трудовом и страховом стаже человека.\n\n"
    "Открывает и ведёт ИЛС Пенсионный фонд. Информацию о стаже в ПФР "
    "отправляет работодатель, который платит взносы за работника.\n\n"
    "Получить выписку ИЛС можно:\n"
    "— через личный кабинет на Госуслугах "
    "(должна быть подтвержденная учетная запись)\n"
    "— в ПФР (ул. Труда, 49), нужен паспорт и СНИЛС\n"
    "— в МФЦ (ул. Жукова, 2), нужен паспорт и СНИЛС\n\n"
    "Порядок получения выписки ИЛС на Госуслугах:\n"
    "1. Зайти в личный кабинет\n"
    "2. Указать в поиске «Лицевой счёт», получить услугу\n"
    "3. Через несколько минут сформируется ответ ПФР\n"
    "4. Открыть выписку\n"
)

ILS_DISCHARGE_DESTINY = (
    "Выписка из ИЛС нужна для того, чтобы:\n"
    "— проверить пенсионные права - учтённый стаж, сведения о "
    "накопительной части пенсии, заработанных пенсионных коэффициентах\n"
    "— проверить выбранный вариант формирования будущей пенсии\n"
    "— узнать, в каком пенсионном фонде размещены ваши пенсионные "
    "накопления и каков результат их инвестирования\n"
    "— проверить отчисления работодателя, которые формируют будущую пенсию\n"
    "— найти и исправить ошибки в индивидуальном лицевом счёте\n"
    "— провести предварительный расчёт будущей пенсии\n\n"
    "ВАЖНО! Хотя бы раз в год рекомендуем Вам отслеживать "
    "информацию о стаже, проверять данные индивидуального лицевого счёта."
)

ILS_APPEAL_GUIDE = (
    "Порядок обращения за выпиской ИЛС:\n"
    "1. Зайти на Госуслуги в личный кабинет\n"
    "2. Через «Поиск» набрать «Выписка из ИЛС» и получить услугу\n"
    "3. Через несколько минут выписка будет сформирована Пенсионным фондом\n"
    "4. Открыть документ\n\n"
    "На что следует обратить внимание в выписке из ИЛС:\n"
)

ILS_DISCHARGE_GUIDE_PART_1 = (
    "На первой странице указаны сведения о застрахованном лице, "
    "есть данные о количестве баллов и страховом стаже "
    "на дату обращения за выпиской.\n\n"
    "В отдельной таблице можно увидеть, сколько у вас уже "
    "выработано льготного стажа. Например:\n\n"
    "— п.1 ч.1 ст.30 - это работа по Списку №1\n"
    "— п.2 ч.1 ст.30 - это работа по Списку №2\n\n"
    "Далее в выписке можно посмотреть данные:\n"
    "— о работодателях\n"
    "— о вашем среднемесячном заработке за 2000-2001 годы "
    "(это имеет значение при назначении пенсии)\n"
    "— о ваших пенсионных накоплениях. Можно посмотреть сколько их "
    "и где они находятся - в ПФР или в Негосударственном Пенсионном фонде\n"
    "— о стаже, в том числе специальном (периоды работы "
    "во вредных условиях труда).\n\n"
    "Обратите внимание, что в выписке информация "
    "о стаже разбита по разделам, которые следуют друг за другом. "
    "Изучите их.\n"
)

ILS_DISCHARGE_GUIDE_PART_2 = (
    "ВАЖНО! В выписке стаж будет указан только по предыдущий год!\n\n"
    "Например - вы запросили выписку в 2021 году - стаж в ней будет указан "
    "по 2020 год включительно. Это связано с тем, "
    "что работодатель сдаёт сведения о стаже в ПФР "
    "только один раз в год (до 1 марта). Следовательно, "
    "стаж за 2021 год «ляжет» в выписку только в 2022 году, "
    "когда ПФР примет и проверит данные от работодателя.\nCтраховые взносы "
    "уплачиваются в ПФР ежеквартально.\n\n"
    "Внимательно проверьте свой стаж на лицевом счёте. Если вы считаете, что "
    "какие-то данные о работе не учтены, обратитесь к работадателю или в ПФР "
    "для уточнения и представления недостающих сведений."
)

ABOUT_2002_WORKS = (
    "Что делать, если в выписке нет стажа до 2002 года?\n\n"
    "1. Зайти на Госуслуги в личный кабинет\n"
    "2. Через «Поиск» выбрать «Выписка из ИЛС» и получить услугу\n"
    "3. Через несколько минут выписка будет сформирована Пенсионным фондом\n"
    "4. Открыть документ\n\n"
    "Если вы обнаружили, что в выписке ИЛС нет "
    "каких-то периодов вашей работы, "
    "сведения неполные или неточные, например, не совпадают даты, "
    "стаж в выписке есть, но он указан без льготы и т.п., "
    "нужно обратиться в ПФР для корректировки индивидуальных сведений.\n\n"
    "ВАЖНО! За «старые» годы стаж подтверждается по документам "
    "(трудовая книжка, военный билет, справки работодателей "
    "или справки из архивов и т.д).\n\n"
    "После 2002 года главным подтверждением стажа являются "
    "индивидуальные сведения, представленные работодателем в ПФР "
    "в электронном виде (уплата страховых взносов)."
)

CONTACT_INFO = (
    "Специалисты Дирекции по персоналу принимают по пенсионным вопросам на "
    "ул. Жукова, 4 (каб. 314)\n\n"
    "Телефоны:\n"
    "56-07-28\n"
    "56-08-71\n"
    "56-09-29"
)
