"""Module with thematic pension constants."""


PENSION_PERIOD = "Выберите интересующий вас период до пенсии"

PENSION_YEAR_PERIOD = (
    "Начинайте готовиться к пенсии заранее. Желательно начать за год, "
    "но не позднее двух месяцев до дня назначения пенсии.\n\n"
    "Обратитесь во фронт-офис на Жукова, 4 (каб. 1.19) "
    "со всеми необходимыми документами.\n\n"
    "Запись через терминал «Сдать документы для оформления пенсии»"
)

SCHEDULE = (
    "Часы работы фронт-офиса на Жукова, 4\n\n"
    "пн-чт — 08.15-17.30, обед 12.00-13.00,\n"
    "пт — 08.15-16.00, обед 12.00-12.45"
)

NEED_DOCUMENTS = (
    "Необходимые документы (оригиналы):\n"
    "— паспорт гражданина РФ (вид на жительство);\n"
    "— СНИЛС;\n"
    "— военный билет;\n"
    "— документ об очном образовании;\n"
    "— свидетельство о браке (если была смена фамилии) или "
    "справка ЗАГС о заключении брака, если брак расторгнут;\n"
    "— свидетельства о рождении детей (женщинам – обязательно, "
    "мужчинам – у которых есть несовершеннолетние дети или "
    "учащиеся до 23 лет по очной форме обучения);\n"
    "— справки Центра занятости населения, если были периоды "
    "получения пособия по безработице;\n"
    "— справки о стаже (работа в совхозе, колхозе и т.д.), "
    "не отраженном в трудовой книжке;\n"
    "— справка, уточняющая льготные условия "
    "труда (в случае наличия на руках);\n"
    "— трудовая книжка (в случае наличия на руках, если работник выбрал "
    "электронный вариант ведения трудовой книжки)"
)

YEARLY_ATTENTION = (
    "Через фронт-офис документы работников предприятия "
    "передаются в ПФР. Специалисты ПФР их получат, проверят, "
    "при необходимости сами сделают запросы.\n\nВ результате информация о "
    "Ваших пенсионных правах (стаж, зарплата) будет полностью учтена "
    "на лицевом счете ПФР.\nЭто позволит "
    "назначить пенсию быстро и в полном объеме!\n\n"
    "Запомните! Заблаговременная работа – это проверка документов. "
    "Она не отменяет необходимость подачи заявления на пенсию.\n\n"
    "Заявление подается в течение месяца до дня назначения пенсии через "
    "Личный кабинет гражданина на сайте ПФР или Госуслугах."
)

MONTH_ATTENTION = (
    "Если вы НЕ сдавали документы на проверку заранее. Как быть? "
    "Куда обращаться с документами?\n\n"
    "Не переживайте. Подайте заявление на пенсию "
    "(в течение месяца до дня установления пенсии) и "
    "предоставьте все необходимые документы ЛИЧНО в Клиентскую "
    "службу ПФР (ул. Труда, 49. Запись на прием 8-800-600-03-45)\n\n"
    "Так как заблаговременно ваши документы в ПФР не проверялись, "
    "срок принятия решения по заявлению на "
    "пенсию может длиться до трех месяцев. "
    "Рекомендуем готовиться к пенсии заранее!\n\n"
    "Информация о назначенной пенсии появится "
    "в Личном кабинете на сайте ПФР или Госуслугах.\n\n"
    "Получите в ПФР (ул. Труда, 49) справку о "
    "назначенной пенсии и свидетельство пенсионера."
)

WAYS_TO_APPLY = (
    "Если у Вас нет возможности или не получается самостоятельно "
    "подать заявление через Личный кабинет гражданина "
    "на сайте ПФР или Госуслугах, "
    "можно обратиться в Клиентскую службу ПФР (ул. Труда, 49).\n\n"
    "Запись на приём в ПФР через Госуслуги или "
    "по телефону горячей линии ПФР 8-800-600-03-45 "
    "(звонок бесплатный).\n\n"
    "Приёмные дни в ПФР: понедельник, вторник, четверг."
)

WHEN_APPLY = (
    "Заявление на пенсию подается В ТЕЧЕНИЕ МЕСЯЦА до "
    "дня назначения пенсии!\n\n"
    "Например, право на пенсию с 22 декабря 2022 года.\n"
    "Заявление можно подать не ранее 22 ноября 2022 года.\n\n"
    "Одновременно с заявлением о назначении пенсии "
    "подаётся заявление о доставке пенсии "
    "(реквизиты банка – платежная система «МИР»). "
)

STATS_GUIDE = (
    "Откройте сайт и введите пароль от своего личного кабинета"
    "В поиске найдите пункт «Извещение о состоянии лицевого счёта в ПФР»"
    "и пройдите по всплывающей подсказке. Нажмите на кнопку «Получить выписку»"
    "Спустя некоторое время проверьте ответ. Откройте документ ..."
)
